SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_ldma.h
/**************************************************************************//**
 * @file
 * @brief EFR32SG23 LDMA register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32SG23_LDMA_H
#define EFR32SG23_LDMA_H

#define LDMA_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32SG23_LDMA LDMA
 * @{
 * @brief EFR32SG23 LDMA Register Declaration.
 *****************************************************************************/

/** LDMA CH Register Group Declaration. */
typedef struct
{
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             CFG;                    /**< Channel Configuration Register                     */
  __IOM uint32_t             LOOP;                   /**< Channel Loop Counter Register                      */
  __IOM uint32_t             CTRL;                   /**< Channel Descriptor Control Word Register           */
  __IOM uint32_t             SRC;                    /**< Channel Descriptor Source Address                  */
  __IOM uint32_t             DST;                    /**< Channel Descriptor Destination Address             */
  __IOM uint32_t             LINK;                   /**< Channel Descriptor Link Address                    */
        uint32_t             RESERVED1[5U];          /**< Reserved for future use                            */
} LDMA_CH_TypeDef;


/** LDMA Register Declaration. */
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< DMA Channel Request Clear Register                 */
  __IOM uint32_t             EN;                     /**< DMA module enable disable Register                 */
  __IOM uint32_t             CTRL;                   /**< DMA Control Register                               */
  __IM  uint32_t             STATUS;                 /**< DMA Status Register                                */
  __IOM uint32_t             SYNCSWSET;              /**< DMA Sync Trig Sw Set Register                      */
  __IOM uint32_t             SYNCSWCLR;              /**< DMA Sync Trig Sw Clear register                    */
  __IOM uint32_t             SYNCHWEN;               /**< DMA Sync HW trigger enable register                */
  __IOM uint32_t             SYNCHWSEL;              /**< DMA Sync HW trigger selection register             */
  __IM  uint32_t             SYNCSTATUS;             /**< DMA Sync Trigger Status Register                   */
  __IOM uint32_t             CHEN;                   /**< DMA Channel Enable Register                        */
  __IOM uint32_t             CHDIS;                  /**< DMA Channel Disable Register                       */
  __IM  uint32_t             CHSTATUS;               /**< DMA Channel Status Register                        */
  __IM  uint32_t             CHBUSY;                 /**< DMA Channel Busy Register                          */
  __IOM uint32_t             CHDONE;                 /**< DMA Channel Linking Done Register                  */
  __IOM uint32_t             DBGHALT;                /**< DMA Channel Debug Halt Register                    */
  __IOM uint32_t             SWREQ;                  /**< DMA Channel Software Transfer Request              */
  __IOM uint32_t             REQDIS;                 /**< DMA Channel Request Disable Register               */
  __IM  uint32_t             REQPEND;                /**< DMA Channel Requests Pending Register              */
  __IOM uint32_t             LINKLOAD;               /**< DMA Channel Link Load Register                     */
  __IOM uint32_t             REQCLEAR;               /**< DMA Channel Request Clear Register                 */
  __IOM uint32_t             IF;                     /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN;                    /**< Interrupt Enable Register                          */
        LDMA_CH_TypeDef      CH[8U];            /**< DMA Channel Registers                              */
        uint32_t             RESERVED0[906U];   /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< DMA Channel Request Clear Register                 */
  __IOM uint32_t             EN_SET;                 /**< DMA module enable disable Register                 */
  __IOM uint32_t             CTRL_SET;               /**< DMA Control Register                               */
  __IM  uint32_t             STATUS_SET;             /**< DMA Status Register                                */
  __IOM uint32_t             SYNCSWSET_SET;          /**< DMA Sync Trig Sw Set Register                      */
  __IOM uint32_t             SYNCSWCLR_SET;          /**< DMA Sync Trig Sw Clear register                    */
  __IOM uint32_t             SYNCHWEN_SET;           /**< DMA Sync HW trigger enable register                */
  __IOM uint32_t             SYNCHWSEL_SET;          /**< DMA Sync HW trigger selection register             */
  __IM  uint32_t             SYNCSTATUS_SET;         /**< DMA Sync Trigger Status Register                   */
  __IOM uint32_t             CHEN_SET;               /**< DMA Channel Enable Register                        */
  __IOM uint32_t             CHDIS_SET;              /**< DMA Channel Disable Register                       */
  __IM  uint32_t             CHSTATUS_SET;           /**< DMA Channel Status Register                        */
  __IM  uint32_t             CHBUSY_SET;             /**< DMA Channel Busy Register                          */
  __IOM uint32_t             CHDONE_SET;             /**< DMA Channel Linking Done Register                  */
  __IOM uint32_t             DBGHALT_SET;            /**< DMA Channel Debug Halt Register                    */
  __IOM uint32_t             SWREQ_SET;              /**< DMA Channel Software Transfer Request              */
  __IOM uint32_t             REQDIS_SET;             /**< DMA Channel Request Disable Register               */
  __IM  uint32_t             REQPEND_SET;            /**< DMA Channel Requests Pending Register              */
  __IOM uint32_t             LINKLOAD_SET;           /**< DMA Channel Link Load Register                     */
  __IOM uint32_t             REQCLEAR_SET;           /**< DMA Channel Request Clear Register                 */
  __IOM uint32_t             IF_SET;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_SET;                /**< Interrupt Enable Register                          */
        LDMA_CH_TypeDef      CH_SET[8U];        /**< DMA Channel Registers                              */
        uint32_t             RESERVED1[906U];   /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< DMA Channel Request Clear Register                 */
  __IOM uint32_t             EN_CLR;                 /**< DMA module enable disable Register                 */
  __IOM uint32_t             CTRL_CLR;               /**< DMA Control Register                               */
  __IM  uint32_t             STATUS_CLR;             /**< DMA Status Register                                */
  __IOM uint32_t             SYNCSWSET_CLR;          /**< DMA Sync Trig Sw Set Register                      */
  __IOM uint32_t             SYNCSWCLR_CLR;          /**< DMA Sync Trig Sw Clear register                    */
  __IOM uint32_t             SYNCHWEN_CLR;           /**< DMA Sync HW trigger enable register                */
  __IOM uint32_t             SYNCHWSEL_CLR;          /**< DMA Sync HW trigger selection register             */
  __IM  uint32_t             SYNCSTATUS_CLR;         /**< DMA Sync Trigger Status Register                   */
  __IOM uint32_t             CHEN_CLR;               /**< DMA Channel Enable Register                        */
  __IOM uint32_t             CHDIS_CLR;              /**< DMA Channel Disable Register                       */
  __IM  uint32_t             CHSTATUS_CLR;           /**< DMA Channel Status Register                        */
  __IM  uint32_t             CHBUSY_CLR;             /**< DMA Channel Busy Register                          */
  __IOM uint32_t             CHDONE_CLR;             /**< DMA Channel Linking Done Register                  */
  __IOM uint32_t             DBGHALT_CLR;            /**< DMA Channel Debug Halt Register                    */
  __IOM uint32_t             SWREQ_CLR;              /**< DMA Channel Software Transfer Request              */
  __IOM uint32_t             REQDIS_CLR;             /**< DMA Channel Request Disable Register               */
  __IM  uint32_t             REQPEND_CLR;            /**< DMA Channel Requests Pending Register              */
  __IOM uint32_t             LINKLOAD_CLR;           /**< DMA Channel Link Load Register                     */
  __IOM uint32_t             REQCLEAR_CLR;           /**< DMA Channel Request Clear Register                 */
  __IOM uint32_t             IF_CLR;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_CLR;                /**< Interrupt Enable Register                          */
        LDMA_CH_TypeDef      CH_CLR[8U];        /**< DMA Channel Registers                              */
        uint32_t             RESERVED2[906U];   /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< DMA Channel Request Clear Register                 */
  __IOM uint32_t             EN_TGL;                 /**< DMA module enable disable Register                 */
  __IOM uint32_t             CTRL_TGL;               /**< DMA Control Register                               */
  __IM  uint32_t             STATUS_TGL;             /**< DMA Status Register                                */
  __IOM uint32_t             SYNCSWSET_TGL;          /**< DMA Sync Trig Sw Set Register                      */
  __IOM uint32_t             SYNCSWCLR_TGL;          /**< DMA Sync Trig Sw Clear register                    */
  __IOM uint32_t             SYNCHWEN_TGL;           /**< DMA Sync HW trigger enable register                */
  __IOM uint32_t             SYNCHWSEL_TGL;          /**< DMA Sync HW trigger selection register             */
  __IM  uint32_t             SYNCSTATUS_TGL;         /**< DMA Sync Trigger Status Register                   */
  __IOM uint32_t             CHEN_TGL;               /**< DMA Channel Enable Register                        */
  __IOM uint32_t             CHDIS_TGL;              /**< DMA Channel Disable Register                       */
  __IM  uint32_t             CHSTATUS_TGL;           /**< DMA Channel Status Register                        */
  __IM  uint32_t             CHBUSY_TGL;             /**< DMA Channel Busy Register                          */
  __IOM uint32_t             CHDONE_TGL;             /**< DMA Channel Linking Done Register                  */
  __IOM uint32_t             DBGHALT_TGL;            /**< DMA Channel Debug Halt Register                    */
  __IOM uint32_t             SWREQ_TGL;              /**< DMA Channel Software Transfer Request              */
  __IOM uint32_t             REQDIS_TGL;             /**< DMA Channel Request Disable Register               */
  __IM  uint32_t             REQPEND_TGL;            /**< DMA Channel Requests Pending Register              */
  __IOM uint32_t             LINKLOAD_TGL;           /**< DMA Channel Link Load Register                     */
  __IOM uint32_t             REQCLEAR_TGL;           /**< DMA Channel Request Clear Register                 */
  __IOM uint32_t             IF_TGL;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_TGL;                /**< Interrupt Enable Register                          */
        LDMA_CH_TypeDef      CH_TGL[8U];        /**< DMA Channel Registers                              */
} LDMA_TypeDef;
/** @} End of group EFR32SG23_LDMA */

/**************************************************************************//**
 * @addtogroup EFR32SG23_LDMA
 * @{
 * @defgroup EFR32SG23_LDMA_BitFields LDMA Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for LDMA IPVERSION */
#define _LDMA_IPVERSION_RESETVALUE              0x00000000UL                            /**< Default value for LDMA_IPVERSION            */
#define _LDMA_IPVERSION_MASK                    0x000000FFUL                            /**< Mask for LDMA_IPVERSION                     */
#define _LDMA_IPVERSION_IPVERSION_SHIFT         0                                       /**< Shift value for LDMA_IPVERSION              */
#define _LDMA_IPVERSION_IPVERSION_MASK          0xFFUL                                  /**< Bit mask for LDMA_IPVERSION                 */
#define _LDMA_IPVERSION_IPVERSION_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for LDMA_IPVERSION             */
#define LDMA_IPVERSION_IPVERSION_DEFAULT        (_LDMA_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for LDMA_IPVERSION     */

/* Bit fields for LDMA EN */
#define _LDMA_EN_RESETVALUE                     0x00000000UL                            /**< Default value for LDMA_EN                   */
#define _LDMA_EN_MASK                           0x00000001UL                            /**< Mask for LDMA_EN                            */
#define LDMA_EN_EN                              (0x1UL << 0)                            /**< LDMA module enable and disable register     */
#define _LDMA_EN_EN_SHIFT                       0                                       /**< Shift value for LDMA_EN                     */
#define _LDMA_EN_EN_MASK                        0x1UL                                   /**< Bit mask for LDMA_EN                        */
#define _LDMA_EN_EN_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for LDMA_EN                    */
#define LDMA_EN_EN_DEFAULT                      (_LDMA_EN_EN_DEFAULT << 0)              /**< Shifted mode DEFAULT for LDMA_EN            */

/* Bit fields for LDMA CTRL */
#define _LDMA_CTRL_RESETVALUE                   0x1E000000UL                            /**< Default value for LDMA_CTRL                 */
#define _LDMA_CTRL_MASK                         0x9F000000UL                            /**< Mask for LDMA_CTRL                          */
#define _LDMA_CTRL_NUMFIXED_SHIFT               24                                      /**< Shift value for LDMA_NUMFIXED               */
#define _LDMA_CTRL_NUMFIXED_MASK                0x1F000000UL                            /**< Bit mask for LDMA_NUMFIXED                  */
#define _LDMA_CTRL_NUMFIXED_DEFAULT             0x0000001EUL                            /**< Mode DEFAULT for LDMA_CTRL                  */
#define LDMA_CTRL_NUMFIXED_DEFAULT              (_LDMA_CTRL_NUMFIXED_DEFAULT << 24)     /**< Shifted mode DEFAULT for LDMA_CTRL          */
#define LDMA_CTRL_CORERST                       (0x1UL << 31)                           /**< Reset DMA controller                        */
#define _LDMA_CTRL_CORERST_SHIFT                31                                      /**< Shift value for LDMA_CORERST                */
#define _LDMA_CTRL_CORERST_MASK                 0x80000000UL                            /**< Bit mask for LDMA_CORERST                   */
#define _LDMA_CTRL_CORERST_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for LDMA_CTRL                  */
#define LDMA_CTRL_CORERST_DEFAULT               (_LDMA_CTRL_CORERST_DEFAULT << 31)      /**< Shifted mode DEFAULT for LDMA_CTRL          */

